plugins/Signature_Wrapping/src/test/resources/saml_over_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    WS-Attacker - A Modular Web Services Penetration Testing Framework
    Copyright (C) 2011  Christian Mainka

    This program is free software; you can redistribute it and/or
    modify it under the terms of the GNU General Public License
    as published by the Free Software Foundation; either version 2
    of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

-->
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="true">
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-1">
        <wsu:Created>2012-08-14T14:58:03.381Z</wsu:Created>
        <wsu:Expires>2012-08-14T15:03:03.381Z</wsu:Expires>
      </wsu:Timestamp>
      <xenc:EncryptedKey Id="EncKeyId-CF1C6BC86588D5241213449562835802">
        <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
        <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <wsse:SecurityTokenReference>
            <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">aqePjuZzE1lzwMMtquksvNJsbmI=</wsse:KeyIdentifier>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
        <xenc:CipherData>
          <xenc:CipherValue>TD4HX2pTiHrs54SK1iv+D5/AL+1DBSmUjphUXJbm3ioSBUkOoOQWU3FF6ACQWexk3GhxDk6ATEeI6D7QAblbog+BMRlX8ZU0hhgleNmpWrKHyf9uOv+i0NyIugGHoP0HOTBLU8HN3V23RsInstL3t1gugnozH/ZJmicErkkrx9s=</xenc:CipherValue>
        </xenc:CipherData>
      </xenc:EncryptedKey>
      <Assertion xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="_964b6c135946019e25c452dc69a601eb" IssueInstant="2012-08-14T14:58:03.794Z" Issuer="SAMPLE_STS" MajorVersion="1" MinorVersion="1">
        <Conditions NotBefore="2012-08-14T14:58:03.792Z" NotOnOrAfter="2012-08-14T15:03:03.792Z"/>
        <AuthenticationStatement AuthenticationInstant="2012-08-14T14:58:03.792Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password">
          <Subject>
            <NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">CN=Sample Client, OU=Rampart, O=Apache, L=Colombo, ST=Western, C=LK</NameIdentifier>
            <SubjectConfirmation>
              <ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</ConfirmationMethod>
              <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                <X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                  <X509Certificate>MIICTzCCAbigAwIBAgIESy9O5zANBgkqhkiG9w0BAQUFADBsMQswCQYDVQQGEwJMSzEQMA4GA1UECBMHV2VzdGVybjEQMA4GA1UEBxMHQ29sb21ibzEPMA0GA1UEChMGQXBhY2hlMRAwDgYDVQQLEwdSYW1wYXJ0MRYwFAYDVQQDEw1TYW1wbGUgQ2xpZW50MB4XDTA5MTIyMTEwMzMxMVoXDTM3MDUwNzEwMzMxMVowbDELMAkGA1UEBhMCTEsxEDAOBgNVBAgTB1dlc3Rlcm4xEDAOBgNVBAcTB0NvbG9tYm8xDzANBgNVBAoTBkFwYWNoZTEQMA4GA1UECxMHUmFtcGFydDEWMBQGA1UEAxMNU2FtcGxlIENsaWVudDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAjBQM+kgC0Wm9hk9v4pjLSg5yK0Em2ulyDmODckWv4mZJ8YwJPVgqEIzwRiOnNBH3s+wFCw297zDsnEgDKSQrsPf1smVUOK/slyDPbqZ47Ewcs07nCPfNigncmpbcaluO3bMw9Oqj9VIYjrUHu5xCp2Fe39ZPbwOzLtAmT8b6iucCAwEAATANBgkqhkiG9w0BAQUFAAOBgQAnjPanrVjFVkxnhsj83RJA2tK//v99KpPf3do9VUI2yEgvBZUzH3q2jk3widwEcsJMHgbRr3VTFL7dNVdCYBcI1KiBY9SMa1XZ4RIHmw7gkJt1JTgjKBzfrout2z614KixRf4w7qkDacGxkNspXG/PSlh03Lfm5sb0vzH1aqBl3g==</X509Certificate>
                </X509Data>
              </KeyInfo>
            </SubjectConfirmation>
          </Subject>
        </AuthenticationStatement>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_964b6c135946019e25c452dc69a601eb">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="code ds kind rw saml samlp typens #default xsd xsi"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>8JTmpFiavqtiTpafJKue83thYaU=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>
GpHSZQrcZonBhIRDH5dGHmZrpU4C8M85tdD+4ZRkeT2MgfDAhKtaTp9qCtZiQGRBYqXRByu3qd/d
b7AB9PWtZ2lVJhFiSSm26ea1Nw22mUsC49Eun1W0MNvrAgDBLArcNm8+pqAznduDiwDkARqXV8Yq
Zapwd4gwil6FzkSiJes=
</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>
MIICkTCCAfqgAwIBAgIER7LDeTANBgkqhkiG9w0BAQQFADCBjDEhMB8GCSqGSIb3DQEJARYSbmFu
ZGFuYUBhcGFjaGUub3JnMQswCQYDVQQGEwJMSzEQMA4GA1UECAwHV2VzdGVybjEQMA4GA1UEBwwH
Q29sb21ibzEPMA0GA1UECgwGQXBhY2hlMRAwDgYDVQQLDAdSYW1wYXJ0MRMwEQYDVQQDDApTYW1w
bGUgU1RTMB4XDTA4MDIxMzEwMTYyNVoXDTMzMDIwNjEwMTYyNVowgYwxITAfBgkqhkiG9w0BCQEW
Em5hbmRhbmFAYXBhY2hlLm9yZzELMAkGA1UEBhMCTEsxEDAOBgNVBAgMB1dlc3Rlcm4xEDAOBgNV
BAcMB0NvbG9tYm8xDzANBgNVBAoMBkFwYWNoZTEQMA4GA1UECwwHUmFtcGFydDETMBEGA1UEAwwK
U2FtcGxlIFNUUzCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAj5hZmwzfwqY3H3Wmw6SspD71
qwkvQ1cgcfpD7zYUf3i3r0598xCR1rsc5zcQXH2URfH7SvROVAWZp9AUxyTi6SflfWftUR5SEDeY
dWmq9knal8VsKRrcg7ciGOEBeMuwEv2HR2ltvwAyi3s/mvH3Q+8xBropWqHucgmtjNRKnKcCAwEA
ATANBgkqhkiG9w0BAQQFAAOBgQBRUI7F0VqJqCxDsQykWtwcow0RM4RZPiC6L5HNO3O5QOKrCYln
jwXcd6HvFBcv0sKV6/lLrXf9YckTL7G4WTnuVp3Rf/4ksYgVuGg1LJxvI7FynRMW/plkk6vlMYyB
L0/TP/40gs0DobtmYWWAwmXLAaMYjcQKyuuiFOkm/lbvjQ==
</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
      </Assertion>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-4">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
          <ds:Reference URI="#Id-1071335501">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>0ELDq4vQwv3k5zzRpJnf5mjp3tY=</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#Timestamp-1">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>Ex2QlZZI9XfwOd+grmmTsk6zMT0=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>3X5dcqi3XSH7FCiH4Gaoarhhtwc=</ds:SignatureValue>
        <ds:KeyInfo Id="KeyId-CF1C6BC86588D5241213449562838546">
          <wsse:SecurityTokenReference xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-CF1C6BC86588D5241213449562838547">
            <wsse:Reference URI="#EncKeyId-CF1C6BC86588D5241213449562835802" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
    <wsa:To>http://localhost:8080/axis2/services/sample06</wsa:To>
    <wsa:MessageID>urn:uuid:9d603252-4a60-41ff-a73f-2f7b30f48a37</wsa:MessageID>
    <wsa:Action>urn:echo</wsa:Action>
  </soapenv:Header>
  <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Id-1071335501">
    <ns1:echo xmlns:ns1="http://sample06.policy.samples.rampart.apache.org">
      <param0>Hello world1</param0>
    </ns1:echo>
  </soapenv:Body>
</soapenv:Envelope>
